ПочтовыйМодуль/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLIMAP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLSMTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогХраненияФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОтбораПисем</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАвтоотправку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАвтополучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПочтовыйМодуль/src/InformationRegisters/УчетныеЗаписиНаАвтоОтправлениеПисем/УчетныеЗаписиНаАвтоОтправлениеПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЗаписиНаАвтоОтправлениеПисем</name>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПочтовыйМодуль/src/InformationRegisters/УчетныеЗаписиНаАвтополучениеПисем/УчетныеЗаписиНаАвтополучениеПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЗаписиНаАвтополучениеПисем</name>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПочтовыйМодуль/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ТОгда //новый
				
	КонецЕсли;
	
	ИнтервалЗапуска = ПолучитьИнтервалЗапускаОтправки(); 
	
	ИнтервалЗапускаПолучения = ПолучитьИнтервалЗапускаОтправкиПолучения(); 

КонецПроцедуры  

&насервере
функция ПолучитьИнтервалЗапускаОтправки()
	 Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ОтправкаОтложенныхПисем"]))[0];  
	возврат Задание.Расписание.ПериодПовтораВТечениеДня;
	
КонецФункции


&насервере
функция ПолучитьИнтервалЗапускаОтправкиПолучения()
	 Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(новый Структура("Метаданные", Метаданные.РегламентныеЗадания["ПолучениеПочты"]))[0];   
	возврат Задание.Расписание.ПериодПовтораВТечениеДня;
	
КонецФункции




&НаКлиенте
Процедура СФормироватьНаименование()
	
	Объект.Наименование = СокрЛП(Объект.ИмяПользователя) + " "+СокрЛП(Объект.АдресЭлектроннойПочты);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	
	СФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяПриИзменении(Элемент)
	
	СФормироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 

	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.КаталогХраненияФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьПисьмаНаСервере()
		ПочтовыйМодуль.ЗагрузитьИОбработатьПочтовыеСообщения(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПисьма(Команда)
	ПолучитьПисьмаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ИспользоватьАвтоотправку тогда
		МенеджерЗаписи = РегистрыСведений.УчетныеЗаписиНаАвтоОтправлениеПисем.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.УчетнаяЗапись = Объект.Ссылка; 
		МенеджерЗаписи.Записать();    	
	иначе
	 	НаборЗаписей = РегистрыСведений.УчетныеЗаписиНаАвтоОтправлениеПисем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗапись.Установить(Объект.Ссылка);
		НаборЗаписей.Записать();   	
	КонецЕсли;    
	
	
	Если Объект.ИспользоватьАвтополучение тогда
		МенеджерЗаписи = РегистрыСведений.УчетныеЗаписиНаАвтополучениеПисем.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.УчетнаяЗапись = Объект.Ссылка; 
		МенеджерЗаписи.Записать();    	
	иначе
	 	НаборЗаписей = РегистрыСведений.УчетныеЗаписиНаАвтополучениеПисем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗапись.Установить(Объект.Ссылка);
		НаборЗаписей.Записать();   	
	КонецЕсли;

	
	
	
КонецПроцедуры
